# Задача «Длина слова»
a = "heelo teacher"
print(len(a))
# Задача «Суммы и разности»
first = 14
second = 16
summa = first + second
diff = first - second
print(summa, second)

# Задача «Среднее арифметическое»
first = 7
second = 14
third = 19
meam = (first + second + third) // 3
print(meam)

# Задача «Простые строчки»
first_string = "Вторник"
second_string = "Понедельник"
print(second_string, ", ", first_string )

# Задача «Сложная формула»
a = 3
b = 7
c = 2
f = ((a * b) + (a * c)**3) // 2
print(f)